---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.PathOfTravel
source: html/7163bc65-8439-5eed-dcff-af13710b6de2.htm
---
# PathOfTravel Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.